OpenFOAMSetting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (80 0 0)
    (80 40 0)
    (0 40 0)
    (0 0 40)
    (80 0 40)
    (80 40 40)
    (0 40 40)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) ); // x = 0
    }

    outlet
    {
        type patch;
        faces ( (2 6 5 1) ); // x = Nx
    }

    upSlipBnd
    {
        type symmetryPlane;
        faces ( (3 7 6 2) ); // y = Ny
    }

    downSolidBnd
    {
        type wall;
        faces ( (1 5 4 0) ); // y = 0
    }

    frontSlipBnd
    {
        type symmetryPlane;
        faces ( (4 5 6 7) ); // z = Nz
    }

    backSlipBnd
    {
        type symmetryPlane;
        faces ( (0 3 2 1) ); // z = 0
    }
);


// ************************************************************************* //
