OpenFOAMSetting/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 10 0 0 );

boundaryField
{
    inlet
    {
        type            exprFixedValue;
        value           uniform ( 10 0 0 );
        valueExpr       #{vector(10.0 * log((pos().y() + 1.0) / 1.0) / log(11.0 / 1.0), 0, 0)#};
        variables       ( );
    }
    outlet
    {
        type            zeroGradient;
    }
    upSlipBnd
    {
        type            symmetryPlane;
    }
    downSolidBnd
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    frontSlipBnd
    {
        type            symmetryPlane;
    }
    backSlipBnd
    {
        type            symmetryPlane;
    }
    solidBnd
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
