OpenFOAMSetting/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    solidBnd
    {
        type            wall;
        inGroups        1 ( wall );
    }
}

U
{
    boundaryField
    {
        solidBnd
        {
            type            fixedValue;
            value           uniform ( 0 0 0 );
        }
    }
}

p
{
    boundaryField
    {
        solidBnd
        {
            type            zeroGradient;
        }
    }
}

nut
{
    boundaryField
    {
        solidBnd
        {
            type            nutUWallFunction;
            value           uniform 0;
        }
    }
}


// ************************************************************************* //
