OpenFOAMSetting/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create a cellSet that contains all the solids (we use the name fluidCells, so in the next 
    // step we can directly invert it).
    {
        name    fluidCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (20 0 18) (24 8 22);
        }
    }

    // Invert the cells created in the last step.
    {
        name    fluidCells;
        type    cellSet;
        action  invert;
    }
);